<?php
/**.-------------------------------------------------------------------------------------------------------------------
 * |  Github: https://github.com/Tinywan
 * |  Blog: http://www.cnblogs.com/Tinywan
 * |--------------------------------------------------------------------------------------------------------------------
 * |  Author: Tinywan(ShaoBo Wan)
 * |  DateTime: 2018/6/22 9:31
 * |  Mail: Overcome.wan@Gmail.com
 * |  Desc: 描述信息
 * '------------------------------------------------------------------------------------------------------------------*/

return [
    'message'=>[
        // 服务器地址
        'host' => '172.19.230.35',
        // 端口号
        'port' => '6379',
        // 密码
        'password' => '',
        // 默认数据库
        'select' => 0,
        // 缓存前缀
        'prefix' => 'REDIS_MESSAGE:',
        // 缓存有效期 0表示永久缓存
        'expire' => 604800
    ],
    'session'=>[
        'host' => '127.0.0.1',
        'port' => '63790',
        'auth' => '',
        'select' => 0,
        'expire' => '7200',
        'timeout' => '0'
    ],
    'location'=>[
        'host' => '127.0.0.1',
        'port' => '6379',
        'auth' => '',
        'select' => 0,
        'expire' => '7200',
        'timeout' => '0'
    ]
];