<?php
/** .-----------------------------------------------------------------------------------------------------------------
 * |  Github: https://github.com/Tinywan
 * |  Blog: http://www.cnblogs.com/Tinywan
 * |-------------------------------------------------------------------------------------------------------------------
 * |  Author: Tinywan(ShaoBo Wan)
 * |  DateTime: 2018/3/26 13:44
 * |  Mail: Overcome.wan@Gmail.com
 * |  Desc: 枚举，使用接口权限控制
 * '------------------------------------------------------------------------------------------------------------------*/

namespace app\common\library\enum;


class ScopeEnum
{
    const USER = 16; // 普通
    const SUPER = 32; // 管理员
}